webapp/app/views/home/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
---
      <% else %>
        <h3 align="right">Welcome <%= User.find_by(id: session[:userid]).username %>!</h3>