webapp/app/controllers/events_controller.rb

def create
  @event = Event.new(params[:event].permit(:title, :description))

  if @event.save
---
INSERT INTO "events" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 23 Aug 2013 13:55:01 UTC +00:00], ["description", "lkjadsf"], ["title", "lkjasdf"], ["updated_at", Fri, 23 Aug 2013 13:55:01 UTC +00:00]]

def update
  @event = Event.find(params[:id])

  if @event.update(params[:event].permit(:title, :description))
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = 4  [["description", "drunk v2"], ["updated_at", Sat, 31 Aug 2013 14:57:03 UTC +00:00]]