webapp/app/controllers/user_to_event_maps_controller.rb

def create
  # TODO: Make a new UserToEventMap object with the event ID (pulled from event page), and user ID (pulled from session).
  @eid = params[:eid]
  @uid = params[:uid]

  @map = UserToEventMap.new(params.permit(:eid, :uid))

  if @map.save
---
INSERT INTO "user_to_event_maps" ("created_at", "eid", "uid", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 29 Dec 2013 21:42:43 UTC +00:00], ["eid", 1], ["uid", 6], ["updated_at", Sun, 29 Dec 2013 21:42:43 UTC +00:00]]