webapp/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Sun, 01 Sep 2013 11:36:48 UTC +00:00], ["password", "kroan81490"], ["updated_at", Sun, 01 Sep 2013 11:36:48 UTC +00:00], ["username", "javasaucelol"]]
---
def create

  @user = User.new(params[:user].permit(:username, :password, :password_confirmation, :gender, :email))

  puts @user.password
  # Assemble a formatted birthdate string
  @clean_dob = Date.parse([params[:user]['birthdate(1i)'], params[:user]['birthdate(2i)'], params[:user]['birthdate(3i)']].join('-'))

  # Assign birthdate to user record
  @user.birthdate = @clean_dob

  if @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = 'christopher3' LIMIT 1
---
def authUser
  @user = User.find_by(username: params['username']).try(:authenticate, params['password'])